FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/АСРМ_СоответствиеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АСРМ_СоответствиеОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АСРМ_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АСРМ_ВидыОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантПараметровПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АСРМ_ВариантыПараметровПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаУточнения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АСРМ_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУточнения</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АСРМ_ВидыОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/АСРМ_ВариантыПараметровПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>АСРМ_ВариантыПараметровПодключения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DSF</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Компания, к которой относится сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Comment>Дата приема на работу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Comment>Дата увольнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагУволен</Name>
					<Comment>Флаг уволен</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения сотрудника</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньРождения</Name>
					<Comment>Месяц и число дня рождения сотрудника для сортировки списка по дням рождения. Формируется автоматически от даты рождения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Признак сотрудника как исполнителя работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Основной цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тт_КатегорияСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тт_КатегорииСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тт_УпрСтруктура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тт_УпрСтруктура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьСтавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТпоШР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляОтображенияВАРМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыДляОтображенияВАРМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнформацияОФОТ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаУстановки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОклада</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/АСРМ_DSFСервис_ПереопределяемыйБИТ_УС/Ext/Module.bsl
Функция ПолучитьБренд(Модель) Экспорт
	Бренд = Неопределено;
	
	РодительМодели = ТТ_Общий.ПолучитьБрэнд(Модель);
	Если Найти(РодительМодели, "FORD")>0 тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АСРМ_СоответствиеОбъектов.Объект
		|ИЗ
		|	РегистрСведений.АСРМ_СоответствиеОбъектов КАК АСРМ_СоответствиеОбъектов
		|ГДЕ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
		//|	И АСРМ_СоответствиеОбъектов.Объект = &Объект
		|	И АСРМ_СоответствиеОбъектов.ВариантПараметровПодключения = &ВариантПараметровПодключения";
		Запрос.УстановитьПараметр("ВидОбъекта",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Бренд);
		//Запрос.УстановитьПараметр("Объект",Модель);
		Запрос.УстановитьПараметр("ВариантПараметровПодключения",Перечисления.АСРМ_ВариантыПараметровПодключения.DSF);
		
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() цикл
			Если Модель.ПринадлежитЭлементу(Результат.Объект) Тогда
				Бренд = Результат.Объект;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Найти(РодительМодели, "UAZ")>0 или Найти(РодительМодели, "УАЗ")  тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АСРМ_СоответствиеОбъектов.Объект
		|ИЗ
		|	РегистрСведений.АСРМ_СоответствиеОбъектовУАЗ КАК АСРМ_СоответствиеОбъектов
		|ГДЕ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
		//|	И АСРМ_СоответствиеОбъектов.Объект = &Объект
		|	И АСРМ_СоответствиеОбъектов.ВариантПараметровПодключения = &ВариантПараметровПодключения";
		Запрос.УстановитьПараметр("ВидОбъекта",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Бренд);
		//Запрос.УстановитьПараметр("Объект",Модель);
		Запрос.УстановитьПараметр("ВариантПараметровПодключения",Перечисления.АСРМ_ВариантыПараметровПодключения.DSF);
		
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() цикл
			Если Модель.ПринадлежитЭлементу(Результат.Объект) Тогда
				Бренд = Результат.Объект;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	Возврат Бренд;	
КонецФункции

Функция ПолучитьЗначениеСвойстваОбъекта(Объект,Свойство,ПустоеЗначение=Неопределено) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("Свойство",Свойство);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат ПустоеЗначение;
	КонецЕсли;
КонецФункции

Функция ЕстьКатегорияОбъекта(Объект,Категория) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Объект = &Объект
	|	И КатегорииОбъектов.Категория = &Категория";
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("Категория",Категория);
	
	Результат=Запрос.Выполнить();
	Возврат Не Результат.Пустой();
КонецФункции


Функция ПолучитьКадровыеДанныеСотрудника(Сотрудник) Экспорт
	СтруктураКадров=Новый Структура("Должность,ДатаПриема,ДатаУвольнения","",'00010101','00010101');
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Должность,
	|	Сотрудники.ДатаПриема,
	|	Сотрудники.ДатаУвольнения
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКадров,Выборка);	
	КонецЕсли;
	
	Возврат СтруктураКадров;
КонецФункции

Функция ПроверитьНеобходимостьОтправкиЗаказНаряда(ЗаказНарядСсылка, Портал) Экспорт
	Результат=Истина;
	
	Если ЗаказНарядСсылка.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		Результат=Ложь;
	КонецЕсли;
	
	//Отправляем только те заказ наряды, по которым сопоставлено 
	//БРЕНД
	//МОДЕЛЬ
	//ЦЕХ
		
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ПолучитьБренд(ЗаказНарядСсылка.Автомобиль.Модель),ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Бренд,"DSF",,,Портал);
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Результат=Ложь;
	КонецЕсли;
	
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНарядСсылка.Автомобиль.Модель.Родитель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Модель,"DSF",,,Портал);
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Результат=Ложь;
	КонецЕсли;
	
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНарядСсылка.Цех,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Пост,"DSF",,,Портал);
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Результат=Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьКонтрагентаЗаказНаряда(ЗаказНарядСсылка) Экспорт 
	Возврат ЗаказНарядСсылка.Заказчик;
КонецФункции

Функция ПолучитьОписаниеКонтрагента(Контрагент,Портал) Экспорт
	
	СтруктураКонтрагента=Новый Структура;
	
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",,,Портал);
	
	СтруктураКонтрагента.Вставить("Ссылка",Контрагент);
	СтруктураКонтрагента.Вставить("Код",СокрЛП(Контрагент.Код));
	СтруктураКонтрагента.Вставить("ИНН",Контрагент.ИНН);
	СтруктураКонтрагента.Вставить("Наименование",СокрЛП(Контрагент));
	
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо  Тогда
		СтруктураКонтрагента.Вставить("Тип","ЮридическоеЛицо");
		СтруктураКонтрагента.Вставить("Имя",СокрЛП(Контрагент));
			
	Иначе
		СтруктураКонтрагента.Вставить("Тип","ФизическоеЛицо");
		
		МассивИмени=АСРМ_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Контрагент.Наименование," ",Истина);
		
		Если МассивИмени.Количество()>1 Тогда
			СтруктураКонтрагента.Вставить("Фамилия",МассивИмени[0]);
			СтруктураКонтрагента.Вставить("Имя",МассивИмени[1]);
			
			Если МассивИмени.Количество()>2 Тогда
				СтруктураКонтрагента.Вставить("Отчество",МассивИмени[2]);
			КонецЕсли;
		Иначе
			СтруктураКонтрагента.Вставить("Имя",СокрЛП(Контрагент));
		КонецЕсли;
		
		Если Контрагент.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
			СтруктураКонтрагента.Вставить("Пол","Мужской");
		ИначеЕсли Контрагент.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
			СтруктураКонтрагента.Вставить("Пол","Женский");
		КонецЕсли;
	КонецЕсли;
	
	ТелефонКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	Если  НЕ ЗначениеЗаполнено(ТелефонКонтрагента) Тогда
		ТелефонКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	КонецЕсли; 
	Если  НЕ ЗначениеЗаполнено(ТелефонКонтрагента) Тогда
		ТелефонКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	КонецЕсли; 
	ТелефонКонтрагента = ПреобразоватьНомерТелефона(ТелефонКонтрагента);
	СтруктураКонтрагента.Вставить("Телефон",ТелефонКонтрагента);
	
	//EmailКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	//Если НЕ ЗначениеЗаполнено(EmailКонтрагента) Тогда
	//	EmailКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	//КонецЕсли;
	//СтруктураКонтрагента.Вставить("email",EmailКонтрагента);
	
	АдресКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Если НЕ ЗначениеЗаполнено(АдресКонтрагента) Тогда
		АдресКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(АдресКонтрагента) Тогда
		АдресКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	СтруктураКонтрагента.Вставить("Адрес", АдресКонтрагента);
	
	СтруктураКонтрагента.Вставить("ДатаРождения", Формат(Контрагент.ДатаРождения, "ДФ=dd.MM.yyyy"));
	
	СогласиеНаОбработку = Контрагент.СогласиеНаОбработкуПерсональныхДанных;
	Если СогласиеНаОбработку = Перечисления.ВариантыОтветов.Да  Тогда
		СтруктураКонтрагента.Вставить("СогласиеНаОбработкуПерсональныхДанных",1);
		СтруктураКонтрагента.Вставить("СогласиеНаПолучениеSMS",1);
	Иначе
		СтруктураКонтрагента.Вставить("СогласиеНаОбработкуПерсональныхДанных",0);
		СтруктураКонтрагента.Вставить("СогласиеНаПолучениеSMS",0);
	КонецЕсли;
	
	
	СтруктураКонтрагента.Вставить("Идентификатор",Идентификатор);
	//СтруктураКонтрагента.Вставить("ХешТелефона",АСРМ_ОбщегоНазначенияСервер.ПолучитьХэшТелефона(СтруктураКонтрагента.Телефон));
		
	Возврат СтруктураКонтрагента;
КонецФункции

Функция ПреобразоватьНомерТелефона(Телефон) Экспорт
	СтТелефон = Телефон;
	Если  СтрДлина(СтТелефон) > 9 Тогда
		// убираем лишнюю шелуху
		СтТелефон = ПолучитьТолькоЦифры(СтТелефон);
		
		ЕстьКодСтраны = ?(Сред(СтТелефон,1,1) = "8" или Сред(СтТелефон,1,1) = "7",Истина,Ложь);
		
		// КодГорода 
		// Мобильный / Москва / Неизвестный = 0
		// Тула = 1
		// Область = 2
		
		н = ?(ЕстьКодСтраны,2,1);		
		СимволКодГорода1 = Сред(СтТелефон,н,1);
		СимволКодГорода13 = Сред(СтТелефон,н,3);
		СимволКодГорода14 = Сред(СтТелефон,н,4);
		
		Если СимволКодГорода1 = "9" ИЛИ (СимволКодГорода1 = "4" И (СимволКодГорода13 = "495" ИЛИ СимволКодГорода13 = "499")) Тогда
			КодГорода = 0;
		ИначеЕсли СимволКодГорода1 = "4" Тогда
			Если СимволКодГорода14 = "4872" Тогда 
				КодГорода = 1;
			иначе
				КодГорода = 2;
			КонецЕсли;
		Иначе
			КодГорода = 0;
		КонецЕсли;
		
		чГород = Сред(СтТелефон,н,3 + КодГорода);
		чТелефон = Сред(СтТелефон,3 + н + КодГорода,7 - КодГорода);
		
		СтТелефон = "+7 (" + чГород + ") " + чТелефон;
	КонецЕсли;
	Возврат СтТелефон;
КонецФункции

Функция ПолучитьТолькоЦифры (Знач мояСтрока) Экспорт
	ДлинаСтроки = СтрДлина(мояСтрока);
	Результат = "";
	Для Индекс = 1 по ДлинаСтроки Цикл
		Символ = Сред(мояСтрока, Индекс, 1);
		Если Найти("1234567890", Символ)>0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьАвтомобильЗаказНаряда(ЗаказНарядСсылка) Экспорт 
	Возврат ЗаказНарядСсылка.Автомобиль;
КонецФункции

Функция ПолучитьОписаниеАвтомобиля(Автомобиль,ЗаказНарядСсылка,Портал) Экспорт
	
	СтруктураОбъекта=Новый Структура;
	
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Автомобиль,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.АвтомобильКлиента,"DSF",,,Портал);
	СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);

	
	СтруктураОбъекта.Вставить("Ссылка",Автомобиль);
	СтруктураОбъекта.Вставить("Код",СокрЛП(Автомобиль.Код));
	
	СтруктураОбъекта.Вставить("Бренд",ПолучитьБренд(Автомобиль.Модель));
	СтруктураОбъекта.Вставить("БрендИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ПолучитьБренд(Автомобиль.Модель),ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Бренд,"DSF",,,Портал));
	
	СтруктураОбъекта.Вставить("Модель",Автомобиль.Модель);
	СтруктураОбъекта.Вставить("МодельИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Автомобиль.Модель.Родитель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Модель,"DSF",,,Портал));
	
	СтруктураОбъекта.Вставить("Комплектация",Автомобиль.ВариантКомплектации.Наименование);
	СтруктураОбъекта.Вставить("Цвет",Автомобиль.Цвет);
	СтруктураОбъекта.Вставить("VIN",Автомобиль.VIN);
	Пробег = ЗаказНарядСсылка.Пробег;
	Если НЕ ЗначениеЗаполнено(Пробег) Тогда
		Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ЗаказНарядСсылка.Дата);
	КонецЕсли;	
	СтруктураОбъекта.Вставить("Пробег",Пробег);


	
	Возврат СтруктураОбъекта;
КонецФункции


Функция ПолучитьМастераЗаказНаряда(ЗаказНарядСсылка) Экспорт 
	Возврат ЗаказНарядСсылка.Диспетчер;
КонецФункции

Функция ПолучитьРекомендацииЗаказНаряда(ЗаказНарядСсылка) Экспорт 
	Возврат ЗаказНарядСсылка.Рекомендации;
КонецФункции

Функция ПолучитьОписаниеСотрудника(Сотрудник,Портал) Экспорт 
	
	СтруктураОбъекта=Новый Структура;
	
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Сотрудник,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Сотрудник,"DSF",,,Портал);
	СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);

	
	СтруктураОбъекта.Вставить("Ссылка",Сотрудник);
	СтруктураОбъекта.Вставить("Код",СокрЛП(Сотрудник.Код));
	
	ФИОМассив=АСРМ_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Сотрудник.Наименование," ");
	
	СтруктураОбъекта.Вставить("Фамилия",ФИОМассив[0]);
	Если ФИОМассив.Количество()>1 Тогда
		СтруктураОбъекта.Вставить("Имя",ФИОМассив[1]);
	Иначе
		СтруктураОбъекта.Вставить("Имя","");
	КонецЕсли;
	Если ФИОМассив.Количество()>2 Тогда
		СтруктураОбъекта.Вставить("Отчество",ФИОМассив[2]);
	Иначе
		СтруктураОбъекта.Вставить("Отчество","");
	КонецЕсли;
	АдресЭлектроннойПочты = киПолучитьПредставлениеКИ(Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		АдресЭлектроннойПочты = киПолучитьПредставлениеКИ(Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	КонецЕсли;
	СтруктураОбъекта.Вставить("АдресЭлектроннойПочты",АдресЭлектроннойПочты);
	
	СтруктураОбъекта.Вставить("ДатаРождения",Формат(Сотрудник.ДатаРождения, "ДФ=dd.MM.yyyy"));
	
	КадровыеДанные=ПолучитьКадровыеДанныеСотрудника(Сотрудник);
	
	СтруктураОбъекта.Вставить("ДатаПриема",Формат(КадровыеДанные.ДатаПриема, "ДФ=dd.MM.yyyy"));
	СтруктураДолжности = Новый Структура;
	СтруктураДолжности.Вставить("id", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(КадровыеДанные.Должность,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Должность,"DSF",,,Портал)); 
	СтруктураОбъекта.Вставить("Должность",СтруктураДолжности);
	
	//СтруктураОбъекта.Вставить("Уволен",ЗначениеЗаполнено(КадровыеДанные.ДатаУвольнения));
	
	Возврат СтруктураОбъекта;
	
КонецФункции

//<<Павличенко 12.03.2020
Процедура ПроверкаВидаРемонта_ТО(ВидРемонта, РезультатПроц)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АСРМ_СоответствиеОбъектов.Объект
	|ИЗ
	|	РегистрСведений.АСРМ_СоответствиеОбъектов КАК АСРМ_СоответствиеОбъектов
	|ГДЕ
	|	АСРМ_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
	|	И АСРМ_СоответствиеОбъектов.Объект = &Объект
	|	И АСРМ_СоответствиеОбъектов.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("ВидОбъекта", ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ВидРемонта);
	Запрос.УстановитьПараметр("Объект", ВидРемонта);
	Запрос.УстановитьПараметр("Идентификатор", 91);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			РезультатПроц = Истина;
			Прервать;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//>>Павличенко 12.03.2020

Функция ПолучитьОписаниеЗаказНаряда(ЗаказНаряд,Портал) Экспорт
	
	СтруктураОбъекта=Новый Структура;
	
	СтруктураОбъекта.Вставить("Ссылка",ЗаказНаряд);
	
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,"DSF",,,Портал);
	СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);

	
	СтруктураОбъекта.Вставить("Номер",ЗаказНаряд.Номер);
	СтруктураОбъекта.Вставить("ДатаСоздания",ЗаказНаряд.ДатаСоздания);
	СтруктураОбъекта.Вставить("ДатаЗакрытия",ЗаказНаряд.ДатаЗакрытия);
	
	//Если Портал = Перечисления.ACPM_Портал.УАЗ тогда
	СтруктураОбъекта.Вставить("Мастер",ПолучитьМастераЗаказНаряда(ЗаказНаряд));
	СтруктураОбъекта.Вставить("МастерИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(СтруктураОбъекта.Мастер,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Сотрудник,"DSF",,,Портал));
	
	Если Портал = Перечисления.ACPM_Портал.FORD тогда
		СтруктураОбъекта.Вставить("Рекомендации",ПолучитьРекомендацииЗаказНаряда(ЗаказНаряд));
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Контрагент",ПолучитьКонтрагентаЗаказНаряда(ЗаказНаряд));
	СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(СтруктураОбъекта.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",,,Портал));
	
	СтруктураОбъекта.Вставить("Автомобиль",ПолучитьАвтомобильЗаказНаряда(ЗаказНаряд));
	СтруктураОбъекта.Вставить("АвтомобильИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(СтруктураОбъекта.Автомобиль,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.АвтомобильКлиента,"DSF",,,Портал));
	 
	Если ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда 
		СтруктураОбъекта.Вставить("Состояние","Закрыт");
	иначе
		СтруктураОбъекта.Вставить("Состояние","Открыт");
	КонецЕсли;
	
	СтруктураВидовРемонта = Новый Структура;
	//<<Павличенко 12.03.2020
	Если Портал = Перечисления.ACPM_Портал.FORD тогда
		РезультатПроверки = Ложь;
		ПроверкаВидаРемонта_ТО(ЗаказНаряд.ВидРемонта, РезультатПроверки);
		Если РезультатПроверки тогда     //ТО
			СтруктураВидовРемонта.Вставить("id", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъектуВидРемонта(ЗаказНаряд));
		Иначе
			СтруктураВидовРемонта.Вставить("id", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд.ВидРемонта,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ВидРемонта,"DSF",,,Портал));
		КонецЕсли;
	Иначе	
		СтруктураВидовРемонта.Вставить("id", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд.ВидРемонта,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ВидРемонта,"DSF",,,Портал));
	КонецЕсли;
	//>>Павличенко 12.03.2020
	СтруктураОбъекта.Вставить("ВидРемонта", СтруктураВидовРемонта);
	СтруктураОбъекта.Вставить("ВидРемонтаИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд.ВидРемонта,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ТипОплаты,"DSF",,,Портал));
	
	СтруктураОбъекта.Вставить("ПричинаОбращения",ЗаказНаряд.ПричинаОбращения);
	
	СтруктураОбъекта.Вставить("Цех",ЗаказНаряд.Цех);
	ЦехИдентификатор = АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд.ВидРемонта,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Пост,"DSF",,,Портал);
	Если НЕ ЗначениеЗаполнено(ЦехИдентификатор) Тогда
		ЦехИдентификатор = АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд.Цех,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Пост,"DSF",,,Портал)
	КонецЕсли;
	СтруктураОбъекта.Вставить("ЦехИдентификатор",ЦехИдентификатор);

	Возврат СтруктураОбъекта;
КонецФункции

Функция ПолучитьОписаниеЗапчастейЗаказНаряда(ЗаказНаряд, Портал) Экспорт
	МассивОписаний=Новый Массив;
	
	ИдентификаторЗаказНаряда= АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,"DSF",,,Портал);
	
	ГарантийныйРемонт=Найти(СокрЛП(НРег(ЗаказНаряд.ВидРемонта)),"гарантийный")>0;
	
	
	Для каждого СтрокаТЧ Из ЗаказНаряд.Товары Цикл
		ОписаниеСтроки=Новый Структура;
		
		Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.СтрокаЗапчастейЗаказНаряда,СтрокаТЧ.НомерСтроки,Портал);
		ОписаниеСтроки.Вставить("Идентификатор",Идентификатор);
		
		ОписаниеСтроки.Вставить("Ссылка",ЗаказНаряд);
		ОписаниеСтроки.Вставить("ЗаказНаряд",ЗаказНаряд);
		
		ОписаниеСтроки.Вставить("ЗаказНарядИдентификатор",ИдентификаторЗаказНаряда);
		
		ОписаниеСтроки.Вставить("НомерСтроки",СтрокаТЧ.НомерСтроки);
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура.Артикул) Тогда
			ОписаниеСтроки.Вставить("Код", СтрокаТЧ.Номенклатура.Артикул);
		Иначе
			ОписаниеСтроки.Вставить("Код", СтрокаТЧ.Номенклатура.Код);
		КонецЕсли;
	
		ОписаниеСтроки.Вставить("Наименование",СтрокаТЧ.Номенклатура.Наименование);
		ОписаниеСтроки.Вставить("Номенклатура",СтрокаТЧ.Номенклатура);
		
		ОписаниеСтроки.Вставить("ГаратийныйРемонт",ГарантийныйРемонт);
		
		ОписаниеСтроки.Вставить("Цена",СтрокаТЧ.Цена);
		ОписаниеСтроки.Вставить("Количество",СтрокаТЧ.Количество);
		ОписаниеСтроки.Вставить("СуммаСкидки",СтрокаТЧ.СуммаВсего-СтрокаТЧ.Сумма);
		ОписаниеСтроки.Вставить("Сумма",СтрокаТЧ.СуммаВсего);
	
		
		МассивОписаний.Добавить(ОписаниеСтроки);
	КонецЦикла;
	
	Возврат МассивОписаний;
КонецФункции

Функция ПолучитьОписаниеРаботЗаказНаряда(ЗаказНаряд,Портал) Экспорт
	МассивОписаний=Новый Массив;
	
	ИдентификаторЗаказНаряда= АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,"DSF",,,Портал);
	
	Для каждого СтрокаТЧ Из ЗаказНаряд.Работы Цикл
		ОписаниеСтроки=Новый Структура;
		
		Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ЗаказНаряд,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.СтрокаРаботЗаказНаряда,СтрокаТЧ.НомерСтроки,Портал);
		ОписаниеСтроки.Вставить("Идентификатор",Идентификатор);
		
		ОписаниеСтроки.Вставить("Ссылка",ЗаказНаряд);
		ОписаниеСтроки.Вставить("ЗаказНаряд",ЗаказНаряд);
		
		ОписаниеСтроки.Вставить("ЗаказНарядИдентификатор",ИдентификаторЗаказНаряда);
		
		ОписаниеСтроки.Вставить("НомерСтроки",СтрокаТЧ.НомерСтроки);
		
		ОписаниеСтроки.Вставить("Код", СтрокаТЧ.Работа.Код);
	
		ОписаниеСтроки.Вставить("Наименование",СтрокаТЧ.Работа.Наименование);
		ОписаниеСтроки.Вставить("Работа",СтрокаТЧ.Работа);
		

		ОписаниеСтроки.Вставить("Цена",СтрокаТЧ.Цена);
		ОписаниеСтроки.Вставить("Количество",СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент);
		ОписаниеСтроки.Вставить("СуммаСкидки",СтрокаТЧ.СуммаВсего-СтрокаТЧ.Сумма);
		ОписаниеСтроки.Вставить("Сумма",СтрокаТЧ.СуммаВсего);
	
		
		МассивОписаний.Добавить(ОписаниеСтроки);
	КонецЦикла;
	
	Возврат МассивОписаний;
КонецФункции


Функция ПолучитьОписаниеКонтрагентаРЛ(РабочийЛист,Портал) Экспорт
	
	СтруктураКонтрагента=Новый Структура;
	Контрагент = РабочийЛист.Контрагент;
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",,,Портал);
		
		СтруктураКонтрагента.Вставить("Ссылка",Контрагент);
		СтруктураКонтрагента.Вставить("Код",СокрЛП(Контрагент.Код));
		СтруктураКонтрагента.Вставить("ИНН",Контрагент.ИНН);
		СтруктураКонтрагента.Вставить("Наименование",СокрЛП(Контрагент));
		
		Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо  Тогда
			СтруктураКонтрагента.Вставить("Тип","ЮридическоеЛицо");
			СтруктураКонтрагента.Вставить("Имя",СокрЛП(Контрагент));
			
		Иначе
			СтруктураКонтрагента.Вставить("Тип","ФизическоеЛицо");
			
			МассивИмени=АСРМ_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Контрагент.Наименование," ",Истина);
			
			Если МассивИмени.Количество()>1 Тогда
				СтруктураКонтрагента.Вставить("Фамилия",МассивИмени[0]);
				СтруктураКонтрагента.Вставить("Имя",МассивИмени[1]);
				
				Если МассивИмени.Количество()>2 Тогда
					СтруктураКонтрагента.Вставить("Отчество",МассивИмени[2]);
				КонецЕсли;
			Иначе
				СтруктураКонтрагента.Вставить("Имя",СокрЛП(Контрагент));
			КонецЕсли;
			Если ЗначениеЗаполнено(Контрагент.Пол) Тогда
				Если Контрагент.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
					СтруктураКонтрагента.Вставить("Пол","Мужской");
				ИначеЕсли Контрагент.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
					СтруктураКонтрагента.Вставить("Пол","Женский");
				КонецЕсли;
			Иначе
				Если РабочийЛист.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
					СтруктураКонтрагента.Вставить("Пол","Мужской");
				ИначеЕсли РабочийЛист.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
					СтруктураКонтрагента.Вставить("Пол","Женский");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ТелефонКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
		Если  НЕ ЗначениеЗаполнено(ТелефонКонтрагента) Тогда
			ТелефонКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
		КонецЕсли; 
		Если  НЕ ЗначениеЗаполнено(ТелефонКонтрагента) Тогда
			ТелефонКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
		КонецЕсли; 
		ТелефонКонтрагента = ПреобразоватьНомерТелефона(ТелефонКонтрагента);
		СтруктураКонтрагента.Вставить("Телефон",ТелефонКонтрагента);
		
		//EmailКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		//Если НЕ ЗначениеЗаполнено(EmailКонтрагента) Тогда
		//	EmailКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
		//КонецЕсли;
		//СтруктураКонтрагента.Вставить("email",EmailКонтрагента);
		
		АдресКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		Если НЕ ЗначениеЗаполнено(АдресКонтрагента) Тогда
			АдресКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(АдресКонтрагента) Тогда
			АдресКонтрагента = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		КонецЕсли;
		СтруктураКонтрагента.Вставить("Адрес", АдресКонтрагента);
		
		СтруктураКонтрагента.Вставить("ДатаРождения", Формат(Контрагент.ДатаРождения, "ДФ=dd.MM.yyyy"));
		
		СогласиеНаОбработку = Контрагент.СогласиеНаОбработкуПерсональныхДанных;
		Если СогласиеНаОбработку = Перечисления.ВариантыОтветов.Да  Тогда
			СтруктураКонтрагента.Вставить("СогласиеНаОбработкуПерсональныхДанных",1);
			СтруктураКонтрагента.Вставить("СогласиеНаПолучениеSMS",1);
		Иначе
			СтруктураКонтрагента.Вставить("СогласиеНаОбработкуПерсональныхДанных",0);
			СтруктураКонтрагента.Вставить("СогласиеНаПолучениеSMS",0);
		КонецЕсли;
		
		
		СтруктураКонтрагента.Вставить("Идентификатор",Идентификатор);
	Иначе
		Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
		СтруктураКонтрагента.Вставить("Ссылка",Контрагент);
		СтруктураКонтрагента.Вставить("Код",СокрЛП(РабочийЛист.номер));
		СтруктураКонтрагента.Вставить("Наименование",СокрЛП(Контрагент));
		СтруктураКонтрагента.Вставить("Тип","ФизическоеЛицо");
		МассивИмени=АСРМ_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Контрагент," ",Истина);
		Если МассивИмени.Количество()>1 Тогда
			СтруктураКонтрагента.Вставить("Фамилия",МассивИмени[0]);
			СтруктураКонтрагента.Вставить("Имя",МассивИмени[1]);		
			Если МассивИмени.Количество()>2 Тогда
				СтруктураКонтрагента.Вставить("Отчество",МассивИмени[2]);
			КонецЕсли;
		Иначе
			СтруктураКонтрагента.Вставить("Имя",СокрЛП(Контрагент));
		КонецЕсли;
		Если ЗначениеЗаполнено(РабочийЛист.ПредставлениеТелефона) Тогда
			СтруктураКонтрагента.Вставить("Телефон",РабочийЛист.ПредставлениеТелефона);
		КонецЕсли;
		СтруктураКонтрагента.Вставить("Идентификатор",Идентификатор);
	КонецЕсли;
	
	Возврат СтруктураКонтрагента;
КонецФункции

Функция ПолучитьАвтомобильРабочегоЛиста(РабочийЛистСсылка) Экспорт 
	Возврат РабочийЛистСсылка.МаркаМодель;
КонецФункции

Функция ПолучитьОписаниеАвтомобиляРЛ(РабочийЛист,Портал) Экспорт
	
	СтруктураОбъекта=Новый Структура;
	Автомобиль = "";
	Если ЗначениеЗаполнено(РабочийЛист.Автомобиль) Тогда
		Автомобиль = РабочийЛист.Автомобиль;
	Иначе
		ЗапросКонтракт = Новый Запрос;
		ЗапросКонтракт.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаАвтомобиль.Автомобиль
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.РабочийЛист = &парРЛ";
		ЗапросКонтракт.УстановитьПараметр("парРЛ", РабочийЛист);
		РезультатКонтракт = ЗапросКонтракт.Выполнить().Выбрать();
		Если РезультатКонтракт.Следующий() Тогда
			Если Не РезультатКонтракт.Автомобиль.Пустая() Тогда
				Автомобиль = РезультатКонтракт.Автомобиль; 
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Автомобиль,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
		СтруктураОбъекта.Вставить("Ссылка",Автомобиль);
		СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);
		СтруктураОбъекта.Вставить("Код",СокрЛП(Автомобиль.Код));
		СтруктураОбъекта.Вставить("Бренд",ПолучитьБренд(Автомобиль.Модель));
		СтруктураОбъекта.Вставить("БрендИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ПолучитьБренд(Автомобиль.Модель),ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Бренд,"DSF",,,Портал));
		СтруктураОбъекта.Вставить("Модель",Автомобиль.Модель);
		СтруктураОбъекта.Вставить("МодельИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Автомобиль.Модель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Модель,"DSF",,,Портал));
		Если ЗначениеЗаполнено(Автомобиль.ВариантКомплектации) Тогда
			СтруктураОбъекта.Вставить("Комплектация",Автомобиль.ВариантКомплектации.Наименование);
		ИначеЕсли ЗначениеЗаполнено(РабочийЛист.ВариантКомплектации) Тогда
			СтруктураОбъекта.Вставить("Комплектация",РабочийЛист.ВариантКомплектации.Наименование);
		Иначе
			СтруктураОбъекта.Вставить("Комплектация","");
		КонецЕсли;
		Если ЗначениеЗаполнено(Автомобиль.Цвет) Тогда
			СтруктураОбъекта.Вставить("Цвет",Автомобиль.Цвет.Наименование);
		ИначеЕсли ЗначениеЗаполнено(РабочийЛист.ВариантКомплектации) Тогда
			СтруктураОбъекта.Вставить("Цвет",РабочийЛист.Цвет.Наименование);
		Иначе
			СтруктураОбъекта.Вставить("Цвет","");
		КонецЕсли;
		СтруктураОбъекта.Вставить("VIN",СокрЛП(Автомобиль.VIN));
	Иначе
		Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Модель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
		СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);
		СтруктураОбъекта.Вставить("Код",СокрЛП(РабочийЛист.Номер));
		СтруктураОбъекта.Вставить("Бренд",ПолучитьБренд(РабочийЛист.Модель));
		СтруктураОбъекта.Вставить("БрендИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(ПолучитьБренд(РабочийЛист.Модель),ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Бренд,"DSF",,,Портал));
		СтруктураОбъекта.Вставить("Модель",РабочийЛист.Модель);
		СтруктураОбъекта.Вставить("МодельИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Модель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Модель,"DSF",,,Портал));
		Если ЗначениеЗаполнено(РабочийЛист.ВариантКомплектации) Тогда
			СтруктураОбъекта.Вставить("Комплектация",РабочийЛист.ВариантКомплектации);
		Иначе
			СтруктураОбъекта.Вставить("Комплектация","");
		КонецЕсли;
	    Если ЗначениеЗаполнено(РабочийЛист.Цвет) Тогда
			СтруктураОбъекта.Вставить("Цвет",РабочийЛист.Цвет.Наименование);
		Иначе
			СтруктураОбъекта.Вставить("Цвет","");
		КонецЕсли;
		СтруктураОбъекта.Вставить("VIN","");
		СтруктураОбъекта.Вставить("Ссылка",РабочийЛист.Модель);

	КонецЕсли;
	ИдентификаторРабочегоЛиста=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,"DSF",,,Портал);
	СтруктураОбъекта.Вставить("ИдентификаторРабочегоЛиста",ИдентификаторРабочегоЛиста);

	Возврат СтруктураОбъекта;

КонецФункции


Функция ПолучитьМенеджерРЛ(РабочийЛистСсылка) Экспорт 
	Возврат РабочийЛистСсылка.Менеджер;
КонецФункции

Функция ПолучитьОписаниеРабочегоЛиста(РабочийЛист,Портал) Экспорт
	
	СтруктураОбъекта=Новый Структура;
	
	СтруктураОбъекта.Вставить("Ссылка",РабочийЛист);
	
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,"DSF",,,Портал);
	СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);

	
	СтруктураОбъекта.Вставить("Номер",РабочийЛист.Номер);
	СтруктураОбъекта.Вставить("ДатаСоздания",РабочийЛист.Дата);

	Если ТипЗнч(РабочийЛист.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",,,Портал));
	Иначе
		СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,РабочийЛист,Портал));
	КонецЕсли;
	Если ЗначениеЗаполнено(РабочийЛист.Автомобиль) Тогда
		Автомобиль = РабочийЛист.Автомобиль;
	Иначе
		ЗапросКонтракт = Новый Запрос;
		ЗапросКонтракт.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаАвтомобиль.Автомобиль
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.РабочийЛист = &парРЛ";
		ЗапросКонтракт.УстановитьПараметр("парРЛ", РабочийЛист);
		РезультатКонтракт = ЗапросКонтракт.Выполнить().Выбрать();
		Если РезультатКонтракт.Следующий() Тогда
			Если Не РезультатКонтракт.Автомобиль.Пустая() Тогда
				Автомобиль = РезультатКонтракт.Автомобиль; 
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		ИдентификаторАвтомобиля=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Автомобиль,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
	Иначе
		ИдентификаторАвтомобиля=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Модель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
	КонецЕсли;
	СтруктураОбъекта.Вставить("АвтомобильИдентификатор",ИдентификаторАвтомобиля);
	СтруктураОбъекта.Вставить("ИсточникОбращения",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Реклама,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ИсточникОбращения,"DSF",,,Портал));

		
	Возврат СтруктураОбъекта;
КонецФункции

Функция ПолучитьОписаниеСобытия(СтрокаСобытия, РабочийЛист,Портал) Экспорт
	СтруктураОбъекта=Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка",СокрЛП(РабочийЛист.Номер + Строка(СтрокаСобытия.НомерСтроки)));
	СтруктураОбъекта.Вставить("Код",СокрЛП(РабочийЛист.Номер + Строка(СтрокаСобытия.НомерСтроки)));
	СтруктураОбъекта.Вставить("ТипСобытияИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(СтрокаСобытия.ВидКонтакта,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ТипыСобытий,"DSF",,,Портал));
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(СокрЛП(РабочийЛист.Номер + Строка(СтрокаСобытия.НомерСтроки)),ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Событие,"DSF",,,Портал);
	СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);
	
	Если СтрокаСобытия.НомерСтроки = 1 Тогда
		СтруктураОбъекта.Вставить("Первичное", "1");
	Иначе
		СтруктураОбъекта.Вставить("Первичное", "0");
	КонецЕсли;
	СтруктураОбъекта.Вставить("Статус", "active");

	СтруктураОбъекта.Вставить("ВремяСобытия", СтрокаСобытия.Дата);
	СтруктураОбъекта.Вставить("РабочийЛистИдентификатор", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,"DSF",,,Портал));
	Если ТипЗнч(РабочийЛист.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",,,Портал));
	Иначе
		СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,РабочийЛист,Портал));
	КонецЕсли;
	Если ЗначениеЗаполнено(РабочийЛист.Автомобиль) Тогда
		Автомобиль = РабочийЛист.Автомобиль;
	Иначе
		ЗапросКонтракт = Новый Запрос;
		ЗапросКонтракт.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаАвтомобиль.Автомобиль
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.РабочийЛист = &парРЛ";
		ЗапросКонтракт.УстановитьПараметр("парРЛ", РабочийЛист);
		РезультатКонтракт = ЗапросКонтракт.Выполнить().Выбрать();
		Если РезультатКонтракт.Следующий() Тогда
			Если Не РезультатКонтракт.Автомобиль.Пустая() Тогда
				Автомобиль = РезультатКонтракт.Автомобиль; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Автомобиль) Тогда
		ИдентификаторАвтомобиля=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Автомобиль,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
	Иначе
		ИдентификаторАвтомобиля=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Модель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
	КонецЕсли;

	СтруктураОбъекта.Вставить("МенеджерИдентификатор", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Менеджер,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Сотрудник,"DSF",,,Портал));
	СтруктураОбъекта.Вставить("АвтомобильИдентификатор",ИдентификаторАвтомобиля);
	СтруктураОбъекта.Вставить("Комментарий",СокрЛП(СтрокаСобытия.ИтогиВстречи));

	Возврат СтруктураОбъекта;


КонецФункции


Функция ПолучитьОписаниеСобытияДокументов(РезультатСобытия, РабочийЛист,Портал) Экспорт
	СтруктураОбъекта=Новый Структура;
	Автомобиль = "";
	СтруктураОбъекта.Вставить("Ссылка",РезультатСобытия.Регистратор);
	Если ТипЗнч(РезультатСобытия.Регистратор) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		СтруктураОбъекта.Вставить("Стоимость",РезультатСобытия.СуммаДокумента);
	Иначе
		СуммаДокумента = РезультатСобытия.Регистратор.Автомобили.Итог("СуммаВсего");
		СтруктураОбъекта.Вставить("Стоимость",СуммаДокумента);
	КонецЕсли;
	СтруктураОбъекта.Вставить("Первичное", "0");
	СтруктураОбъекта.Вставить("Код",СокрЛП(РезультатСобытия.Номер));
	СтруктураОбъекта.Вставить("ТипСобытияИдентификатор",РезультатСобытия.ТипСобытия);
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РезультатСобытия.Регистратор,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Событие,"DSF",,,Портал);
	СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);
	
	Попытка
		Если РезультатСобытия.Состояние = Перечисления.СостоянияСобытий.Отменено Тогда
			СтруктураОбъекта.Вставить("Статус", "canceled");
		Иначе
			СтруктураОбъекта.Вставить("Статус", "active");
		КонецЕсли;	
	Исключение
		СтруктураОбъекта.Вставить("Статус", "active");
	КонецПопытки;
	СтруктураОбъекта.Вставить("ВремяСобытия", РезультатСобытия.ДатаНачала);
	СтруктураОбъекта.Вставить("РабочийЛистИдентификатор", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,"DSF",,,Портал));
	Если ТипЗнч(РабочийЛист.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",,,Портал));
	Иначе
		СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,РабочийЛист,Портал));
	КонецЕсли;
	СтруктураОбъекта.Вставить("МенеджерИдентификатор", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Менеджер,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Сотрудник,"DSF",,,Портал));
	Если ЗначениеЗаполнено(РабочийЛист.Автомобиль) Тогда
		Автомобиль = РабочийЛист.Автомобиль;
	Иначе
		ЗапросКонтракт = Новый Запрос;
		ЗапросКонтракт.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаАвтомобиль.Автомобиль
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.РабочийЛист = &парРЛ";
		ЗапросКонтракт.УстановитьПараметр("парРЛ", РабочийЛист);
		РезультатКонтракт = ЗапросКонтракт.Выполнить().Выбрать();
		Если РезультатКонтракт.Следующий() Тогда
			Если Не РезультатКонтракт.Автомобиль.Пустая() Тогда
				Автомобиль = РезультатКонтракт.Автомобиль; 
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Автомобиль) Тогда
		ИдентификаторАвтомобиля=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Автомобиль,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
	Иначе
		ИдентификаторАвтомобиля=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Модель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
	КонецЕсли;
	СтруктураОбъекта.Вставить("АвтомобильИдентификатор",ИдентификаторАвтомобиля);
	СтруктураОбъекта.Вставить("Комментарий",РезультатСобытия.Содержание);

	Возврат СтруктураОбъекта;


КонецФункции


Функция ПолучитьОписаниеСобытияТД(РезультатСобытия, РабочийЛист,Портал) Экспорт
	СтруктураОбъекта=Новый Структура;
	Автомобиль = "";
	СтруктураОбъекта.Вставить("Ссылка",РезультатСобытия.Регистратор);
	СтруктураОбъекта.Вставить("Код",СокрЛП(РезультатСобытия.Номер));
	СтруктураОбъекта.Вставить("ТипСобытияИдентификатор","test-drive");
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РезультатСобытия.Регистратор,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Событие,"DSF",,,Портал);
	СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);	
	СтруктураОбъекта.Вставить("Первичное", "0");
	СтруктураОбъекта.Вставить("Статус", "active");
	СтруктураОбъекта.Вставить("ВремяСобытия", РезультатСобытия.ДатаНачала);
	СтруктураОбъекта.Вставить("РабочийЛистИдентификатор", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,"DSF",,,Портал));
	Если ТипЗнч(РабочийЛист.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",,,Портал));
	Иначе
		СтруктураОбъекта.Вставить("КонтрагентИдентификатор",АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Контрагент,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,РабочийЛист,Портал));
	КонецЕсли;
	СтруктураОбъекта.Вставить("МенеджерИдентификатор", АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Менеджер,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Сотрудник,"DSF",,,Портал));
	Если ЗначениеЗаполнено(РабочийЛист.Автомобиль) Тогда
		Автомобиль = РабочийЛист.Автомобиль;
	Иначе
		ЗапросКонтракт = Новый Запрос;
		ЗапросКонтракт.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаАвтомобиль.Автомобиль
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.РабочийЛист = &парРЛ";
		ЗапросКонтракт.УстановитьПараметр("парРЛ", РабочийЛист);
		РезультатКонтракт = ЗапросКонтракт.Выполнить().Выбрать();
		Если РезультатКонтракт.Следующий() Тогда
			Если Не РезультатКонтракт.Автомобиль.Пустая() Тогда
				Автомобиль = РезультатКонтракт.Автомобиль; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Автомобиль) Тогда
		ИдентификаторАвтомобиля=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(Автомобиль,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
	Иначе
		ИдентификаторАвтомобиля=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист.Модель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
	КонецЕсли;
	СтруктураОбъекта.Вставить("АвтомобильИдентификатор",ИдентификаторАвтомобиля);
	СтруктураОбъекта.Вставить("Комментарий",РезультатСобытия.Результат);

	Возврат СтруктураОбъекта;


КонецФункции


Функция ПолучитьОписаниеПланирования(РезультатСобытия,РабочийЛист,Портал) Экспорт

	СтруктураОбъекта=Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка",РезультатСобытия.Ссылка);
	СтруктураОбъекта.Вставить("Код",СокрЛП(РезультатСобытия.Номер));
	СтруктураОбъекта.Вставить("ВремяСобытия", РезультатСобытия.Дата);
	СтруктураОбъекта.Вставить("РабочийЛистИдентификатор",  АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛист,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,"DSF",Портал));
	СтруктураОбъекта.Вставить("Содержание",СокрЛП(РезультатСобытия.Описание));
	СтруктураОбъекта.Вставить("Результат",СокрЛП(РезультатСобытия.Результат.Наименование));

	СтруктураОбъекта.Вставить("ДатаФактическогоЗавершения",РезультатСобытия.ДатаЗакрытия);
	СтруктураОбъекта.Вставить("ДатаСоздания",РезультатСобытия.Дата);
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РезультатСобытия.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ПланированиеКонтакта,"DSF",Портал);
	СтруктураОбъекта.Вставить("Идентификатор",Идентификатор);
	Возврат СтруктураОбъекта;

КонецФункции
